wpirri/dom32-web-pic32-bootloader/sd/sd_spi.c
    if(brg > 0x100)
        brg = 0x100;

    if(brg)
        brg--;

    return (unsigned char) brg;
}

/*********************************************************************
 * Function:         unsigned int getcSPI(void)
 *
 * PreCondition:    None
 * Input:           None
 * Output:          the contents of SPIBUF register in byte/hword/word format
 * Side Effects:    None
 * Overview:        This function waits for receive data to be available.
 * 					It will then read single byte/half word/word from SPI bus.
 * Note:            Having byte/hword/word accesses will perform correctly.
 *
 *                  When a new data word has been shifted into shift register SPIxSR and 
 *                  the previous contents of receive register SPIxRXB have not been read
 *                  by the user software, then SPIROV bit (SPIxSTAT<6>) will be set.The 
 *                  module will not transfer the received data from SPIxSR to the SPIxRXB. 
 *                  Further data reception is disabled until the SPIROV bit is cleared. 
 *                  The SPIROV bit is not cleared automatically by the module and must be 
 *                  cleared by the user software.
 ********************************************************************/
unsigned int getcSPI(void)
{
	while(!DataRdySPI());		// wait receive data available
	return ReadSPI();
}

/*********************************************************************
 * Function:        unsigned int getsSPI1(unsigned int length, unsigned int *rdptr,
 * 											unsigned int spi_data_wait)
 *
 * PreCondition:    None
 * Input:           length			- The length of data expected
 * 					rdptr			- the received data to be recorded to this array
 * 					spi_data_wait	- timeout value
 * Output:          number of data bytes yet to be received
 * Side Effects:    None
 * Overview:        This routine reads a string from the SPI receive buffer.
 * 					The number of byte/word to be read is determined by parameter 'length'.
 * Note:            rdptr is considered to be 8/16/32 bits data pointer, according to the
 * 					current SPI mode!
 *
 *                  When a new data word has been shifted into shift register SPIxSR and 
 *                  the previous contents of receive register SPIxRXB have not been read
 *                  by the user software, then SPIROV bit (SPIxSTAT<6>) will be set.The 
 *                  module will not transfer the received data from SPIxSR to the SPIxRXB. 
 *                  Further data reception is disabled until the SPIROV bit is cleared. 
 *                  The SPIROV bit is not cleared automatically by the module and must be 
 *                  cleared by the user software.
 ********************************************************************/
unsigned int getsSPI(unsigned int length, unsigned int *rdptr, unsigned int spi_data_wait)
{
	int				wait;
	unsigned int	rxData;
	unsigned char*			pBuff8=(unsigned char*)rdptr;
	__SPI1CONbits_t	conBits;
	unsigned short*			pBuff16=(unsigned short*)rdptr;

	conBits.w=SPI1CONbits.w;

	while (length)                     /* stay in loop until length = 0  */
	{
		wait = 0;
		while(!DataRdySPI())
		{
			if(wait++ > spi_data_wait)
			{
				return length;	/* if time out, return number of byte/hword/words left to be read */
			}
		}
		rxData=SPIBUF;
		if(conBits.MODE32)
		{
			*rdptr++=rxData;			// 32 bits
		}
		else if(conBits.MODE16)
		{
			*pBuff16++=(unsigned short)rxData;	// 16 bits
		}
		else
		{
			*pBuff8++=(unsigned char)rxData;		// 8 bits
		}

        length--;                      /* reduce string length count by 1*/
    }
    return (length);                   /* return number of bytes/hwords/words to be read i.e, 0 */
}

/*********************************************************************
 * Function:        void putsSPI(unsigned int length, unsigned int *wrptr)
 *
 * PreCondition:    None
 * Input:           length	- length of bytes/words to be written
 * 					wrptr	- address of buffer storing the data to be transmitted.
 * Output:          None
 * Side Effects:    None
 * Overview:        This function writes the specified length of data words/bytes
 * 					from the specified buffer.
 * Note:            wrptr is considered to be 8/16/32 bits data pointer, according to the
 * 					current SPI mode!
 ********************************************************************/
void putsSPI(unsigned int length, unsigned int *wrptr)
{
	unsigned char*			pBuff8=(unsigned char*)wrptr;
	__SPI1CONbits_t 		conBits;
	unsigned short*			pBuff16=(unsigned short*)wrptr;

	conBits.w=SPI1CONbits.w;

    while (length--)                   /* write byte/word until length is 0 */
    {
		while(TxBufFullSPI());  /* wait until there's room in the buffer */
		if(conBits.MODE32)
		{
			SPIBUF=*wrptr++;
		}
		else if(conBits.MODE16)
		{
			SPIBUF=*pBuff16++;
		}
		else
		{
			SPIBUF=*pBuff8++;
		}
    }
}

/*********************************************************
  Function:
    BYTE MDD_SDSPI_MediaDetect
  Summary:
    Determines whether an SD card is present
  Conditions:
    The MDD_MediaDetect function pointer must be configured
    to point to this function in FSconfig.h
  Input:
    None
  Return Values:
    TRUE -  Card detected
    FALSE - No card detected
  Side Effects:
    None.
  Description:
    The MDD_SDSPI_MediaDetect function determine if an SD card is connected to 
    the microcontroller.
    If the MEDIA_SOFT_DETECT is not defined, the detection is done by polling
    the SD card detect pin.
    The MicroSD connector does not have a card detect pin, and therefore a
    software mechanism must be used. To do this, the SEND_STATUS command is sent 
    to the card. If the card is not answering with 0x00, the card is either not 
    present, not configured, or in an error state. If this is the case, we try
    to reconfigure the card. If the configuration fails, we consider the card not 
    present (it still may be present, but malfunctioning). In order to use the 
    software card detect mechanism, the MEDIA_SOFT_DETECT macro must be defined.
    
